reports/2021-02-16_BDD2MIP/BDD2MIP.org
#+TITLE: \textbf{\today:} CPP from BDDs (simple example), updated.
#+OPTIONS: toc:nil author:nil date:nil
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}

* Run a code :noexport:
#+name: UFL_out
#+begin_src bash  :results verbatim :cache yes
python ../../UFL.py
#+end_src

#+RESULTS[2005df20c68b602600e9c39d1bc3acc093c2efcd]: UFL_out
#+begin_example
Using license file /home/bochkarev/gurobi.lic
Academic license - for non-commercial use only
Minimize
   <gurobi.LinExpr: 0.1 A_vh0_1 + 0.2 A_vh9_11 + 0.2 A_vh10_13 + 0.3 A_vh20_22 + 0.3 A_vh21_24 + C_vh0_1 + 2.0 C_vh3_4 + C_vl3_4 + C_vh2_4 + 2.0 C_vh8_10 + C_vl8_10 + 3.0 C_vh9_10 + 2.0 C_vl9_10 + C_vh7_10 + C_vh11_-1 + 2.0 C_vh12_-1 + C_vl12_-1>
Subject To
   A_cont-at-0 : <gurobi.LinExpr: -1.0 A_vh0_1 + -1.0 A_vl0_2> = -1.0
   A_bin-link-1 : <gurobi.LinExpr: link_x1 + -1.0 A_vh0_1> = 0.0
   A_cont-at-1 : <gurobi.LinExpr: A_vh0_1 + -1.0 A_vh1_3 + -1.0 A_vl1_5> = 0.0
   A_cont-at-2 : <gurobi.LinExpr: A_vl0_2 + -1.0 A_vh2_5 + -1.0 A_vl2_4> = 0.0
   A_bin-link-2 : <gurobi.LinExpr: link_z1-1 + -1.0 A_vh1_3 + -1.0 A_vh2_5> = 0.0
   A_cont-at-3 : <gurobi.LinExpr: A_vh1_3 + -1.0 A_vh3_6 + -1.0 A_vl3_8> = 0.0
   A_cont-at-4 : <gurobi.LinExpr: A_vl2_4 + -1.0 A_vh4_8 + -1.0 A_vl4_7> = 0.0
   A_cont-at-5 : <gurobi.LinExpr: A_vl1_5 + A_vh2_5 + -1.0 A_vh5_8 + -1.0 A_vl5_8> = 0.0
   A_bin-link-3 : <gurobi.LinExpr: link_z1-2 + -1.0 A_vh3_6 + -1.0 A_vh4_8 + -1.0 A_vh5_8> = 0.0
   A_cont-at-8 : <gurobi.LinExpr: A_vl3_8 + A_vh4_8 + A_vh5_8 + A_vl5_8 + -1.0 A_vh8_10 + -1.0 A_vl8_10> = 0.0
   A_cont-at-6 : <gurobi.LinExpr: A_vh3_6 + -1.0 A_vh6_9 + -1.0 A_vl6_10> = 0.0
   A_cont-at-7 : <gurobi.LinExpr: A_vl4_7 + -1.0 A_vh7_10 + -1.0 A_vl7_9> = 0.0
   A_bin-link-4 : <gurobi.LinExpr: link_z1-3 + -1.0 A_vh8_10 + -1.0 A_vh6_9 + -1.0 A_vh7_10> = 0.0
   A_cont-at-9 : <gurobi.LinExpr: A_vh6_9 + A_vl7_9 + -1.0 A_vh9_11 + -1.0 A_vl9_12> = 0.0
   A_cont-at-10 : <gurobi.LinExpr: A_vh8_10 + A_vl8_10 + A_vl6_10 + A_vh7_10 + -1.0 A_vh10_13 + -1.0 A_vl10_13> = 0.0
   A_bin-link-5 : <gurobi.LinExpr: link_x2 + -1.0 A_vh9_11 + -1.0 A_vh10_13> = 0.0
   A_cont-at-11 : <gurobi.LinExpr: A_vh9_11 + -1.0 A_vh11_14 + -1.0 A_vl11_16> = 0.0
   A_cont-at-12 : <gurobi.LinExpr: A_vl9_12 + -1.0 A_vh12_16 + -1.0 A_vl12_15> = 0.0
   A_cont-at-13 : <gurobi.LinExpr: A_vh10_13 + A_vl10_13 + -1.0 A_vh13_16 + -1.0 A_vl13_16> = 0.0
   A_bin-link-6 : <gurobi.LinExpr: link_z2-2 + -1.0 A_vh11_14 + -1.0 A_vh12_16 + -1.0 A_vh13_16> = 0.0
   A_cont-at-14 : <gurobi.LinExpr: A_vh11_14 + -1.0 A_vh14_17 + -1.0 A_vl14_19> = 0.0
   A_cont-at-16 : <gurobi.LinExpr: A_vl11_16 + A_vh12_16 + A_vh13_16 + A_vl13_16 + -1.0 A_vh16_19 + -1.0 A_vl16_19> = 0.0
   A_cont-at-15 : <gurobi.LinExpr: A_vl12_15 + -1.0 A_vh15_19 + -1.0 A_vl15_18> = 0.0
   A_bin-link-7 : <gurobi.LinExpr: link_z2-3 + -1.0 A_vh14_17 + -1.0 A_vh16_19 + -1.0 A_vh15_19> = 0.0
   A_cont-at-17 : <gurobi.LinExpr: A_vh14_17 + -1.0 A_vh17_20 + -1.0 A_vl17_21> = 0.0
   A_cont-at-18 : <gurobi.LinExpr: A_vl15_18 + -1.0 A_vh18_21 + -1.0 A_vl18_20> = 0.0
   A_cont-at-19 : <gurobi.LinExpr: A_vl14_19 + A_vh16_19 + A_vl16_19 + A_vh15_19 + -1.0 A_vh19_21 + -1.0 A_vl19_21> = 0.0
   A_bin-link-8 : <gurobi.LinExpr: link_z2-4 + -1.0 A_vh17_20 + -1.0 A_vh18_21 + -1.0 A_vh19_21> = 0.0
   A_cont-at-20 : <gurobi.LinExpr: A_vh17_20 + A_vl18_20 + -1.0 A_vh20_22 + -1.0 A_vl20_23> = 0.0
   A_cont-at-21 : <gurobi.LinExpr: A_vl17_21 + A_vh18_21 + A_vh19_21 + A_vl19_21 + -1.0 A_vh21_24 + -1.0 A_vl21_24> = 0.0
   A_bin-link-9 : <gurobi.LinExpr: link_x3 + -1.0 A_vh20_22 + -1.0 A_vh21_24> = 0.0
   A_cont-at-24 : <gurobi.LinExpr: A_vh21_24 + A_vl21_24 + -1.0 A_vh24_27 + -1.0 A_vl24_27> = 0.0
   A_cont-at-23 : <gurobi.LinExpr: A_vl20_23 + -1.0 A_vh23_27 + -1.0 A_vl23_26> = 0.0
   A_cont-at-22 : <gurobi.LinExpr: A_vh20_22 + -1.0 A_vh22_25 + -1.0 A_vl22_27> = 0.0
   A_bin-link-10 : <gurobi.LinExpr: link_z3-3 + -1.0 A_vh24_27 + -1.0 A_vh23_27 + -1.0 A_vh22_25> = 0.0
   A_cont-at-25 : <gurobi.LinExpr: A_vh22_25 + -1.0 A_vh25_-1 + -1.0 A_vl25_-2> = 0.0
   A_cont-at-26 : <gurobi.LinExpr: A_vl23_26 + -1.0 A_vh26_-2 + -1.0 A_vl26_-1> = 0.0
   A_cont-at-27 : <gurobi.LinExpr: A_vh24_27 + A_vl24_27 + A_vh23_27 + A_vl22_27 + -1.0 A_vh27_-2 + -1.0 A_vl27_-2> = 0.0
   A_bin-link-11 : <gurobi.LinExpr: link_z3-4 + -1.0 A_vh25_-1 + -1.0 A_vh26_-2 + -1.0 A_vh27_-2> = 0.0
   A_cont-at--1 : <gurobi.LinExpr: A_vh25_-1 + A_vl26_-1> = 1.0
   A_cont-at--2 : <gurobi.LinExpr: A_vl25_-2 + A_vh26_-2 + A_vh27_-2 + A_vl27_-2> = 0.0
   C_cont-at-0 : <gurobi.LinExpr: -1.0 C_vh0_1 + -1.0 C_vl0_1> = -1.0
   C_bin-link-1 : <gurobi.LinExpr: link_z1-1 + -1.0 C_vh0_1> = 0.0
   C_cont-at-1 : <gurobi.LinExpr: C_vh0_1 + C_vl0_1 + -1.0 C_vh1_3 + -1.0 C_vl1_2> = 0.0
   C_bin-link-2 : <gurobi.LinExpr: link_z1-2 + -1.0 C_vh1_3> = 0.0
   C_cont-at-3 : <gurobi.LinExpr: C_vh1_3 + -1.0 C_vh3_4 + -1.0 C_vl3_4> = 0.0
   C_cont-at-2 : <gurobi.LinExpr: C_vl1_2 + -1.0 C_vh2_4 + -1.0 C_vl2_4> = 0.0
   C_bin-link-3 : <gurobi.LinExpr: link_z2-2 + -1.0 C_vh3_4 + -1.0 C_vh2_4> = 0.0
   C_cont-at-4 : <gurobi.LinExpr: C_vh3_4 + C_vl3_4 + C_vh2_4 + C_vl2_4 + -1.0 C_vh4_6 + -1.0 C_vl4_5> = 0.0
   C_bin-link-4 : <gurobi.LinExpr: link_z1-3 + -1.0 C_vh4_6> = 0.0
   C_cont-at-6 : <gurobi.LinExpr: C_vh4_6 + -1.0 C_vh6_9 + -1.0 C_vl6_8> = 0.0
   C_cont-at-5 : <gurobi.LinExpr: C_vl4_5 + -1.0 C_vh5_8 + -1.0 C_vl5_7> = 0.0
   C_bin-link-5 : <gurobi.LinExpr: link_z2-3 + -1.0 C_vh6_9 + -1.0 C_vh5_8> = 0.0
   C_cont-at-8 : <gurobi.LinExpr: C_vl6_8 + C_vh5_8 + -1.0 C_vh8_10 + -1.0 C_vl8_10> = 0.0
   C_cont-at-9 : <gurobi.LinExpr: C_vh6_9 + -1.0 C_vh9_10 + -1.0 C_vl9_10> = 0.0
   C_cont-at-7 : <gurobi.LinExpr: C_vl5_7 + -1.0 C_vh7_10 + -1.0 C_vl7_10> = 0.0
   C_bin-link-6 : <gurobi.LinExpr: link_z3-3 + -1.0 C_vh8_10 + -1.0 C_vh9_10 + -1.0 C_vh7_10> = 0.0
   C_cont-at-10 : <gurobi.LinExpr: C_vh8_10 + C_vl8_10 + C_vh9_10 + C_vl9_10 + C_vh7_10 + C_vl7_10 + -1.0 C_vh10_12 + -1.0 C_vl10_11> = 0.0
   C_bin-link-7 : <gurobi.LinExpr: link_z2-4 + -1.0 C_vh10_12> = 0.0
   C_cont-at-11 : <gurobi.LinExpr: C_vl10_11 + -1.0 C_vh11_-1 + -1.0 C_vl11_-1> = 0.0
   C_cont-at-12 : <gurobi.LinExpr: C_vh10_12 + -1.0 C_vh12_-1 + -1.0 C_vl12_-1> = 0.0
   C_bin-link-8 : <gurobi.LinExpr: link_z3-4 + -1.0 C_vh11_-1 + -1.0 C_vh12_-1> = 0.0
   C_cont-at--1 : <gurobi.LinExpr: C_vh11_-1 + C_vl11_-1 + C_vh12_-1 + C_vl12_-1> = 1.0
   C_cont-at--2 : <gurobi.LinExpr: 0.0> = 0.0
Binaries
   ['link_x1', 'link_z1-1', 'link_z1-2', 'link_z1-3', 'link_x2', 'link_z2-2', 'link_z2-3', 'link_z2-4', 'link_x3', 'link_z3-3', 'link_z3-4']
#+end_example

