reports/2021-02-16_BDD2MIP/BDD2MIP.tex
% Created 2021-02-16 Tue 16:32
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[margin=1in]{geometry}
\date{}
\title{\textbf{\today:} CPP from BDDs (simple example), updated.}
\hypersetup{
 pdfauthor={Alexey Bochkarev},
 pdftitle={\textbf{\today:} CPP from BDDs (simple example), updated.},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
